# Built In Failures View Position Failures View Anchor Does Not Support View Property

Source: https://www.revitapidocs.com/2026/263e2547-d999-b16f-cfa7-0ac0bee0518e.htm

---

| Built In Failures View Position Failures View Anchor Does Not Support View Property |
| --- |

The View Anchor ""%1!s!"" is not supported by view ""%2!s!"".
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId ViewAnchorDoesNotSupportView { get; }
```

```
Public Shared ReadOnly Property ViewAnchorDoesNotSupportView As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ ViewAnchorDoesNotSupportView {
	FailureDefinitionId^ get ();
}
```

```
static member ViewAnchorDoesNotSupportView : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ViewPositionFailures Class Autodesk.Revit.DB Namespace